Repository: kblc/Royalty
Catalog: RoyaltyRepository/Properties/Resources.*.resx
Languages: ru

# AccountDictionaryExcludeMaxLength
source: Exclude parameter length must be less or equals 250
ru: Значение параметра для исключения не может превышать 250

# AccountDictionaryExcludeMinLength
source: Exclude parameter can't be empty
ru: Значение параметра для исключения не может быть пустым

# AccountDictionaryExcludeRequired
source: Exclude parameter required
ru: Необходимо задать значение параметру для исключения

# AccountNameMaxLength
source: Account name length must be less or equals 250
ru: Название аккаунта не может превышать 250 символов

# AccountNameRequired
source: Account name can't be empty
ru: Название аккаунта не может быть пустым

# MarkNameMaxLength
source: Mark system name length must be less or equals 100
ru: Системное имя метки не может превышать 100 символов

# MarkNameMinLength
source: Mark system name can't be empty
ru: Системное имя метки не может быть пустым

# MarkNameRequred
source: Mark system name required
ru: Необходимо указать системное имя метки

# MARK_HALFTRUSTED
source: Half trusted
ru: Полудоверенная

# MARK_UNKNOWN
source: Unknown
ru: Неизвестная

# MARK_NOTTRUSTED
source: Not trusted
ru: Не доверенная

# MARK_SUSPICIOUS
source: Suspicious
ru: Подозрительная

# MARK_TRUSTED
source: Trusted
ru: Доверенная

# PhoneNumberMaxLength
source: Phone number length must be less or equals 20
ru: Номер телефона не может превышать 20 символов

# PhoneNumberMinLength
source: Phone number can't be empty
ru: Номер телефона не может быть пустым

source: Phone number required
ru: Необходимо указать номер телефона

# CityNameMaxLength
source: City name length must be less or equals 100
ru: Название города не может превышать 100 символов

# CityNameMinLength
source: City name can't be empty
ru: Название города не может быть пустым

source: City name required
ru: Необходимо указать название города

# HostNameMaxLength
source: Host name length must be less or equals 250
ru: Имя хоста не может превышать 250 символов

# HostNameRequred
source: Host name can't be empty
ru: Имя хоста не может быть пустым

# DataAdditionalColumnNameMaxLength
source: Column name can't be empty
ru: Имя колонки не может превышать 250 символов

# DataAdditionalColumnNameRequired
source: Column name length must be less or equals 250
ru: Имя колонки не может быть пустым

# DataAdditionalColumnSystemNameMaxLength
source: System column name can't be empty
ru: Системное имя колонки не может превышать 250 символов

# DataAdditionalColumnSystemNameRequired
source: System column name length must be less or equals 250
ru: Системное имя колонки не может быть пустым

source: Default account not found
ru: Не найден аккаунт "по-умолчанию"

# QueueRecordStateNameMaxLength
source: Record state name length must be less or equals 20
ru: Системное имя состояния записи не может превышать 20 символов

# QueueRecordStateNameRequred
source: Record state name required
ru: Необходимо указать системное имя состояния записи очереди

# QUEUERECORDSTATE_ERROR
source: Error
ru: Ошибка

# QUEUERECORDSTATE_PROCESSED
source: Processed
ru: Запись обработана

# QUEUERECORDSTATE_TRYTOPROCESS
source: Try to proceed
ru: Попытка обработки записи

# QUEUERECORDSTATE_WAIT
source: Wait
ru: Ожидание загрузки

# StreetNameMaxLength
source: Street name length must be less or equals 100
ru: Название улицы не может превышать 100 символов

# StreetNameRequred
source: Street name required
ru: Необходимо указать название улицы

# MARK_DEFAULT
source: Not setted
ru: Не установленная

# CityPhoneNumberCodeMaxLength
source: Default phone number code length must be less or equals 20
ru: Телефонный код города не может превышать 20 символов

# HouseNumberMaxLength
source: House number length must be less or equals 20
ru: Номер дома не может превышать 20 символов

# ColumnTypeNameMaxLength
source: Path type system name length must be less or equals 100
ru: Системное имя типа пути не может превышать 100 символов

# ColumnTypeNameRequred
source: Path type system name required
ru: Необходимо указать системное имя типа пути

# COLUMNTYPE_ADDRESS
source: Address
ru: Адрес

# COLUMNTYPE_AREA
source: Area
ru: Район

# COLUMNTYPE_CITY
source: City
ru: Город

# COLUMNTYPE_HOST
source: Host
ru: Ссылка

# COLUMNTYPE_MARK
source: Mark
ru: Метка

# COLUMNTYPE_PHONE
source: Phone
ru: Телефон

# Logic_Street_StreetRemove_StreetContainsDataRecords
source: Street {0} contains {1} data records.
ru: На улицу '{0}' есть ссылки в данных в количестве {1}

# Logic_Street_StreetRemove_StreetContainsDataRecords_TerminateDeletion
source: Terminate deletion.
ru: Отмена удаления

# HISTORYSOURCETYPE_Account
source: Account
ru: Аккаунт

# HISTORYSOURCETYPE_Queue
source: Qeueu
ru: Очередь

# HISTORYACTIONTYPE_Add
source: Record added
ru: Запись добавлена

# HISTORYACTIONTYPE_Change
source: Record changed
ru: Запись изменена

# HISTORYACTIONTYPE_Remove
source: Record removed
ru: Запись удалена

# HISTORYSOURCETYPE_AccountData
source: Account data records
ru: Данные аккаунта

# HISTORYSOURCETYPE_AccountDictionary
source: Account dictionary
ru: Словарь аккаунта

# HISTORYSOURCETYPE_AccountSettings
source: Account settings
ru: Настройки аккаунта
